[Killed] BlockStatement
src/Roller.ts:10:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        this._faces = faces >= 2 ? faces : 6;
-        this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
-        this._last = 0;
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller tests Roll a valid value should update the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Survived] EqualityOperator
src/Roller.ts:11:23
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        this._faces = faces >= 2 ? faces : 6;
+        this._faces = faces < 2 ? faces : 6;
         this._distribution = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {

[Survived] ConditionalExpression
src/Roller.ts:11:23
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        this._faces = faces >= 2 ? faces : 6;
+        this._faces = false ? faces : 6;
         this._distribution = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {

[Killed] BlockStatement
src/Roller.ts:29:33
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number {
-        if (value >= 1 && value <= this._faces) {
-            this._last = value;
-            this._distribution.set(value, this._distribution.get(value)! + 1);
-        } else {
-            value = 0;
-        }
-        return value;
-    }
+    roll(value: number): number {}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests Roll a valid value should update the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/Roller.ts:30:49
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number {
-        if (value >= 1 && value <= this._faces) {
-            this._last = value;
-            this._distribution.set(value, this._distribution.get(value)! + 1);
-        } else {
+        if (value >= 1 && value <= this._faces) {} else {
             value = 0;
         }
killedBy: Roller tests Roll a valid value should update the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ArithmeticOperator
src/Roller.ts:32:43
     roll(value: number): number {
         if (value >= 1 && value <= this._faces) {
             this._last = value;
-            this._distribution.set(value, this._distribution.get(value)! + 1);
+            this._distribution.set(value, this._distribution.get(value)! - 1);
         } else {
             value = 0;
killedBy: Roller tests Roll a valid value should update the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/Roller.ts:33:16
         if (value >= 1 && value <= this._faces) {
             this._last = value;
             this._distribution.set(value, this._distribution.get(value)! + 1);
-        } else {
-            value = 0;
-        }
+        } else {}
         return value;
     }
killedBy: Roller tests Roll an invalid value should return 0.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 7

[Killed] BlockStatement
src/Roller.ts:50:41
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number> {
-        return new Map(this._distribution);
-    }
+    distribution(): Map<number, number> {}
 
 }
killedBy: Roller tests Roll a valid value should update the last roll and distribution.
statusReason: TypeError: Cannot read properties of undefined (reading 'get')
